## ПРОЕКТ 1
-------
Необходимо решить следующую задачу:

*Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам.*

Задачу условно необходимо решить тремя частями используя пройденные уроки:
1. Файл с алгоритмом (блок - схема);
2. Файл с программой решающую данную задачу (реализация в программе С#);
3. Файл READMI.md (Markdown) с текстовым описанием проекта.
_______

 ### *Текстовое описание решения будем основывать на программе С# с ориентацией на блок-схему .*

Разобъем задачу на составные логические части и последовательность порядка выполнения:

 1. Создание массива со значениями, которые в последствии будут сортироваться (*значения вводим рандомно, но для чистоты эксперемента в значениях должно быть и более и менее трёх элементов*).
>string[] mas;

>mas = new string[] {"new", "star", "superstar", ":D"};

2. Создаем метод, который будет выводить в консоли заданный массив

>void ShowArray(string[] array)
{
    Console.Write("[");
   for (int i = 0; i < array.Length; i++)
    {
        if(i == array.Length - 1) Console.Write(array[i]);
        else Console.Write(array[i] + "; ");
    }
    Console.Write("]");
}

*не забываем отформатировать, для читаемости кода*

3. Нам необходимо узнать РАЗМЕР будущего нового массива, в которые нам нужно будет положить элементы <= 3. Для этого вводим переменную *size* и с помощью цикла *for* перебираем массив (от первого до последнего значения), чтобы узнать количесво элементов в нём. И если (*if*) в индексе <= 3 элемента, плюсуем в счётчик *size*

>int size = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i].Length <= 3) size++;
    }
string[] arr = new string[size];

*не забываем отформатировать, для читаемости кода*

4. Теперь мы можем создать новый массив, зная его размер, а именно он будет являться переменной *size*

>string[] arr = new string[size];

5. Снова с помощью цикла *for* перебираем изначально заданный массив, при этом "заливая" нужные нам значения (а именно: элементы <= 3) в новый массив, созданный в п.4. Для этого необходимо создать переменную *k*, которая является индексами в новом массиве.
>int k = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i].Length <= 3)
        {
            arr[k] = array[i];
            k++;
        }
    }

*не забываем отформатировать, для читаемости кода*

6. Теперь необходимо п. 3 - 5 "упаковать" в метод, с возвращаемым значением. Создаем метод типа *string* и с помощью *return* возвращаем массив с нужными элементами.

>string[] CreateNewMass(string[] array)
{
    return arr;
}

*внутри метода должны находяться пп. 3-5.*

*не забываем отформатировать, для читаемости кода*

6. Вызываем метод печати первичного заданного массива, для красоты введём между печатями массивов строку *Console.Write("->");* Вызываем метод сортировки массива. И вызываем метод, который нам его напечатает.
> ShowArray(mas);
Console.Write("->");
string[] mas2 = CreateNewMass(mas);
ShowArray(mas2);

*не забываем отформатировать, для читаемости кода*

Задача решена!